# https://www.machinelearningplus.com/python/101-pandas-exercises-python/

1. How to import pandas and check the version?

In [54]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [3]:
import pandas as pd
import numpy as np
print(pd.__version__)
print(pd.show_versions(as_json=True))

0.25.1
{'system': {'commit': None, 'python': '3.6.7.final.0', 'python-bits': 64, 'OS': 'Linux', 'OS-release': '5.0.0-29-generic', 'machine': 'x86_64', 'processor': 'x86_64', 'byteorder': 'little', 'LC_ALL': 'None', 'LANG': 'en_US.UTF-8', 'LOCALE': 'en_US.UTF-8'}, 'dependencies': {'pandas': '0.25.1', 'numpy': '1.17.2', 'pytz': '2019.3', 'dateutil': '2.8.0', 'pip': '19.2.3', 'setuptools': '41.4.0', 'Cython': None, 'pytest': None, 'hypothesis': None, 'sphinx': None, 'blosc': None, 'feather': None, 'xlsxwriter': None, 'lxml.etree': '4.4.1', 'html5lib': None, 'pymysql': None, 'psycopg2': None, 'jinja2': '2.10.3', 'IPython': '7.8.0', 'pandas_datareader': None, 'bs4': '4.8.1', 'bottleneck': None, 'fastparquet': None, 'gcsfs': None, 'matplotlib': '3.1.1', 'numexpr': None, 'odfpy': None, 'openpyxl': None, 'pandas_gbq': None, 'pyarrow': '0.15.0', 'pytables': None, 's3fs': None, 'scipy': '1.3.1', 'sqlalchemy': None, 'tables': None, 'xarray': None, 'xlrd': '1.2.0', 'xlwt': None}}
None

2. How to create a series from a list, numpy array and dict?

In [6]:
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

In [9]:
serie_list=pd.Series(mylist)
serie_list.head()

0    a
1    b
2    c
3    e
4    d
dtype: object

In [10]:
serie_array=pd.Series(myarr)
serie_array.head()

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [12]:
serie_dict=pd.Series(mydict)
serie_dict.head()

a    0
b    1
c    2
e    3
d    4
dtype: int64

3. How to convert the index of a series into a column of a dataframe?

In [13]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)

In [15]:
ser.reset_index().head()

  index  0
0     a  0
1     b  1
2     c  2
3     e  3
4     d  4

4. How to combine many series to form a dataframe?

In [16]:
import numpy as np
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [35]:
df=pd.concat([ser1,ser2],axis=1)
df=pd.DataFrame(df)
df.head()

   0  1
0  a  0
1  b  1
2  c  2
3  e  3
4  d  4

5. How to assign name to the seriesâ€™ index?

In [36]:
ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))

In [38]:
ser.name='alphabet'
ser.head()

0    a
1    b
2    c
3    e
4    d
Name: alphabet, dtype: object

6. How to get the items of series A not present in series B?

In [48]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [50]:
ser1[~ser1.isin(ser2)]

0    1
1    2
2    3
dtype: int64

7. How to get the items not common to both series A and series B?

In [51]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [55]:
union=pd.Series(np.union1d(ser1,ser2))
intersection=pd.Series(np.intersect1d(ser1,ser2))
union.head(10)
intersection.head()

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

0    4
1    5
dtype: int64

In [56]:
union[~union.isin(intersection)]

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?

In [57]:
ser = pd.Series(np.random.normal(10, 5, 25))

In [60]:
np.percentile(ser,q=[0,25,50,75,100])

array([ 4.75153655,  7.47391555, 11.51529486, 14.09258981, 23.35904426])

9. How to get frequency counts of unique items of a series?

In [61]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))

In [62]:
ser.head()

0    e
1    a
2    g
3    f
4    g
dtype: object

In [63]:
ser.value_counts()

b    6
a    6
f    5
c    5
g    4
h    3
e    1
dtype: int64

10. How to keep only top 2 most frequent values as it is and replace everything else as â€˜Otherâ€™?

In [83]:
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))

RandomState(MT19937) at 0x7FB3BB9DF468

In [84]:
freq=ser.value_counts()
freq[0:2]
freq.index
ser[~ser.isin(freq.index[:2])]='Other'
ser

3    6
2    4
dtype: int64

Int64Index([3, 2, 4], dtype='int64')

0         3
1         2
2         3
3     Other
4         3
5     Other
6         3
7         2
8         3
9         3
10        2
11        2
dtype: object

11. How to bin a numeric series to 10 groups of equal size?

In [86]:
ser = pd.Series(np.random.random(20))

In [89]:
pd.qcut(ser,q=[0,.1,.2,.3,.4,.5,.6,.7,.8,.9,1]).head()

0     (0.787, 0.864]
1     (0.787, 0.864]
2     (0.658, 0.717]
3    (0.0987, 0.262]
4     (0.471, 0.575]
dtype: category
Categories (10, interval[float64]): [(0.0987, 0.262] < (0.262, 0.301] < (0.301, 0.471] < (0.471, 0.575] ... (0.658, 0.717] < (0.717, 0.767] < (0.767, 0.787] < (0.787, 0.864]]

12. How to convert a numpy array to a dataframe of given shape? (L1)

In [95]:
ser = pd.Series(np.random.randint(1, 10, 35))
df=pd.DataFrame(ser.values.reshape(7,5))
df

   0  1  2  3  4
0  5  4  2  3  8
1  2  3  3  1  1
2  3  5  4  8  5
3  5  5  4  3  6
4  2  7  3  8  8
5  8  8  9  6  8
6  6  4  4  7  4

13. How to find the positions of numbers that are multiples of 3 from a series?

In [102]:
ser = pd.Series(np.random.randint(1, 10, 7))
ser

0    1
1    3
2    1
3    8
4    1
5    8
6    5
dtype: int64

In [103]:
items=[]
for i in range(len(ser)):
    if i%3==0:
        items.append(ser[i])
    else:
        pass
items

[1, 8, 5]

14. How to extract items at given positions from a series

In [104]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

In [105]:
ser.take(pos)

0     a
4     e
8     i
14    o
20    u
dtype: object

15. How to stack two series vertically and horizontally ?

In [108]:
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

In [116]:
pd.concat([ser1,ser2])
pd.concat([ser1,ser2],axis=1)

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

16. How to get the positions of items of series A in another series B?

In [117]:
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

In [121]:
[pd.Index(ser1).get_loc(i) for i in ser2]

[5, 4, 0, 8]

17. How to compute the mean squared error on a truth and predicted series?

In [122]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

In [135]:
df=pd.DataFrame(pd.concat([truth,pred],axis=1))
df.columns=['truth','pred']
df['diff']=pred-truth
df['sqdiff']=(pred-truth)**2
df.mean()
df.head()

truth     4.500000
pred      5.069343
diff      0.569343
sqdiff    0.394069
dtype: float64

   truth      pred      diff    sqdiff
0      0  0.863856  0.863856  0.746247
1      1  1.195479  0.195479  0.038212
2      2  2.197310  0.197310  0.038931
3      3  3.582702  0.582702  0.339541
4      4  4.767665  0.767665  0.589310

18. How to convert the first character of each element in a series to uppercase?

In [139]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])

In [141]:
ser.map(lambda x: x[0].upper()+x[1:])

0     How
1      To
2    Kick
3    Ass?
dtype: object

19. How to calculate the number of characters in each word in a series?

In [143]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])

In [145]:
count=[]
for i in ser:
    count.append(len(i))
    
count

[3, 2, 4, 4]

In [146]:
ser.map(lambda x: len(x))

0    3
1    2
2    4
3    4
dtype: int64

20. How to compute difference of differences between consequtive numbers of a series?

In [147]:
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

In [149]:
ser.diff().diff()

0    NaN
1    NaN
2    1.0
3    1.0
4    1.0
5    1.0
6    0.0
7    2.0
dtype: float64

21. How to convert a series of date-strings to a timeseries?

In [150]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

In [153]:
pd.to_datetime(ser)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

22. How to get the day of month, week number, day of year and day of week from a series of date strings?

In [154]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

In [181]:
from datetime import datetime

ser=pd.to_datetime(ser)
date=ser.apply(lambda x: x.strftime('%d'))
weeknr=ser.apply(lambda x: x.strftime('%W'))
dayofyear=ser.apply(lambda x: x.strftime('%j'))
dayofweek=ser.apply(lambda x: x.strftime('%A'))
date
weeknr
dayofyear
dayofweek

0    01
1    02
2    03
3    04
4    05
5    06
dtype: object

0    00
1    05
2    09
3    13
4    18
5    22
dtype: object

0    001
1    033
2    063
3    094
4    125
5    157
dtype: object

0       Friday
1    Wednesday
2     Saturday
3     Thursday
4       Monday
5     Saturday
dtype: object

23. How to convert year-month string to dates corresponding to the 4th day of the month?

In [182]:
ser = pd.Series(['Jan 2010', 'Feb 2011', 'Mar 2012'])

In [196]:
import datetime

ser=pd.to_datetime(ser)

result=ser.apply(lambda x: x+datetime.timedelta(days=3))
result

0   2010-01-04
1   2011-02-04
2   2012-03-04
dtype: datetime64[ns]

24. How to filter words that contain atleast 2 vowels from a series?

In [197]:
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

In [201]:
vocals=['a','e','i','o','u']
ser2voc=[]
for x in ser:
    count=0
    for i in x:
        for z in vocals:
            if i.lower()==z:
                count+=1
            else:
                pass
    if count >1:
        ser2voc.append(x)
ser2voc

['Apple', 'Orange', 'Money']

25. How to filter valid emails from a series?

In [202]:
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'

In [203]:
emails.head()

0    buying books at amazom.com
1             rameses@egypt.com
2                     matt@t.co
3             narendra@modi.com
dtype: object

In [208]:
import re
mask=emails.map(lambda x: bool(re.match(pattern,x)))
emails[mask]

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

26. How to get the mean of a series grouped by another series?

In [221]:
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))
print(weights.tolist())
print(fruit.tolist())

[1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]
['carrot', 'apple', 'apple', 'carrot', 'carrot', 'banana', 'banana', 'banana', 'banana', 'carrot']

In [222]:
df=pd.concat([fruit,weights],axis=1)
df.columns=(['fruit','weights'])
df.head()
df.groupby(fruit).mean()

    fruit  weights
0  carrot      1.0
1   apple      2.0
2   apple      3.0
3  carrot      4.0
4  carrot      5.0

        weights
apple       2.5
banana      7.5
carrot      5.0

27. How to compute the euclidean distance between two series?

In [223]:
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])

In [224]:
sum((p-q)**2)**.5

18.16590212458495

28. How to find all the local maxima (or peaks) in a numeric series?

In [225]:
ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])

In [238]:
diff=np.sign(ser.diff()).diff()

peaks=np.where(diff==-2)[0]-1
peaks

array([1, 5, 7])

29. How to replace missing spaces in a string with the least frequent character?

In [239]:
my_str = 'dbc deb abed gade'

In [261]:
letter=pd.Series(list(my_str)).value_counts(ascending=True).index[0]
ser=pd.Series(list(my_str)).replace(' ',letter)
print(''.join(ser))

dbcgdebgabedggade

30. How to create a TimeSeries starting â€˜2000-01-01â€™ and 10 weekends (saturdays) after that having random numbers as values?

In [264]:
dates=pd.date_range('2000-01-01',periods=10,freq='W-SAT')
dates

DatetimeIndex(['2000-01-01', '2000-01-08', '2000-01-15', '2000-01-22',
               '2000-01-29', '2000-02-05', '2000-02-12', '2000-02-19',
               '2000-02-26', '2000-03-04'],
              dtype='datetime64[ns]', freq='W-SAT')

In [266]:
ser=pd.Series(np.random.randint(1,10,10),dates)
ser

2000-01-01    6
2000-01-08    8
2000-01-15    4
2000-01-22    2
2000-01-29    3
2000-02-05    7
2000-02-12    1
2000-02-19    7
2000-02-26    6
2000-03-04    4
Freq: W-SAT, dtype: int64

31. How to fill an intermittent time series so all missing dates show up with values of previous non-missing date?

In [267]:
ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))
print(ser)

2000-01-01     1.0
2000-01-03    10.0
2000-01-06     3.0
2000-01-08     NaN
dtype: float64

In [274]:
ser.resample('D').ffill()

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
Freq: D, dtype: float64

32. How to compute the autocorrelations of a numeric series?

In [277]:
ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))
ser.head()

0    13.728102
1     6.084778
2    11.750407
3     1.061005
4    -0.230588
dtype: float64

In [278]:

autocorrelations = [ser.autocorr(i).round(2) for i in range(11)]
print(autocorrelations[1:])
print('Lag having highest correlation: ', np.argmax(np.abs(autocorrelations[1:]))+1)

[-0.01, 0.08, -0.03, 0.19, 0.11, 0.02, 0.0, 0.03, -0.28, -0.58]
Lag having highest correlation:  10

33. How to import only every nth row from a csv file to create a dataframe?

In [280]:
data='https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv'

In [288]:
df=pd.read_csv(data)
df['medv']=df.medv.apply(lambda x: 'High' if x>25 else 'Low')
df.head()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,Low
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,Low
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,High
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,High
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,High

35. How to create a dataframe with rows as strides from a given series?

In [290]:
L = pd.Series(range(15))
L

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
dtype: int64

36. How to import only specified columns from a csv file?

In [294]:
df=pd.read_csv(data,usecols=['crim','medv'])
df.head()

      crim  medv
0  0.00632  24.0
1  0.02731  21.6
2  0.02729  34.7
3  0.03237  33.4
4  0.06905  36.2

37. How to get the nrows, ncolumns, datatype, summary stats of each column of a dataframe? Also get the array and list equivalent.

In [304]:
df=pd.read_csv(data)
df.shape
df.dtypes
df.describe()
df.values

(506, 14)

crim       float64
zn         float64
indus      float64
chas         int64
nox        float64
rm         float64
age        float64
dis        float64
rad          int64
tax          int64
ptratio    float64
b          float64
lstat      float64
medv       float64
dtype: object

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
count,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000
mean,3.613524,11.363636,11.136779,0.069170,0.554695,6.284634,68.574901,3.795043,9.549407,408.237154,18.455534,356.674032,12.653063,22.532806
std,8.601545,23.322453,6.860353,0.253994,0.115878,0.702617,28.148861,2.105710,8.707259,168.537116,2.164946,91.294864,7.141062,9.197104
min,0.006320,0.000000,0.460000,0.000000,0.385000,3.561000,2.900000,1.129600,1.000000,187.000000,12.600000,0.320000,1.730000,5.000000
25%,0.082045,0.000000,5.190000,0.000000,0.449000,5.885500,45.025000,2.100175,4.000000,279.000000,17.400000,375.377500,6.950000,17.025000
50%,0.256510,0.000000,9.690000,0.000000,0.538000,6.208500,77.500000,3.207450,5.000000,330.000000,19.050000,391.440000,11.360000,21.200000
75%,3.677082,12.500000,18.100000,0.000000,0.624000,6.623500,94.075000,5.188425,24.000000,666.000000,20.200000,396.225000,16.955000,25.000000
max,88.976200,100.000000,27.740000,1.000000,0.871000,8.780000,100.000000,12.126500,24.000000,711.000000,22.000000,396.900000,37.970000,50.000000

array([[6.3200e-03, 1.8000e+01, 2.3100e+00, ..., 3.9690e+02, 4.9800e+00,
        2.4000e+01],
       [2.7310e-02, 0.0000e+00, 7.0700e+00, ..., 3.9690e+02, 9.1400e+00,
        2.1600e+01],
       [2.7290e-02, 0.0000e+00, 7.0700e+00, ..., 3.9283e+02, 4.0300e+00,
        3.4700e+01],
       ...,
       [6.0760e-02, 0.0000e+00, 1.1930e+01, ..., 3.9690e+02, 5.6400e+00,
        2.3900e+01],
       [1.0959e-01, 0.0000e+00, 1.1930e+01, ..., 3.9345e+02, 6.4800e+00,
        2.2000e+01],
       [4.7410e-02, 0.0000e+00, 1.1930e+01, ..., 3.9690e+02, 7.8800e+00,
        1.1900e+01]])

38. How to extract the row and column number of a particular cell with given criterion?

In [306]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.head()

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,NaN,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

In [308]:
df.loc[df.Price==np.max(df.Price),['MAnufacturer','Model','Type','Price']]

    MAnufacturer Model     Type  Price
58           NaN  300E  Midsize   61.9

In [311]:
row,col=np.where(df.values==np.max(df.Price))
df.iloc[row[0],col[0]]

61.9

39. How to rename a specific columns in a dataframe?

In [323]:
df=df.rename(columns={'Type':'CarType'})

df.columns=df.columns.map(lambda x: x.replace('.','_'))
df.columns

df.head()

Index(['Manufacturer', 'Model', 'CarType', 'Min_Price', 'Price', 'Max_Price',
       'MPG_city', 'MPG_highway', 'AirBags', 'DriveTrain', 'Cylinders',
       'EngineSize', 'Horsepower', 'RPM', 'Rev_per_mile', 'Man_trans_avail',
       'Fuel_tank_capacity', 'Passengers', 'Length', 'Wheelbase', 'Width',
       'Turn_circle', 'Rear_seat_room', 'Luggage_room', 'Weight', 'Origin',
       'Make'],
      dtype='object')

,Manufacturer,Model,CarType,Min_Price,Price,Max_Price,MPG_city,MPG_highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn_circle,Rear_seat_room,Luggage_room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,NaN,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

40. How to check if a dataframe has any missing values?

In [335]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.head()
df.isnull().values.any()

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,NaN,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

True

41. How to count the number of missing values in each column?

In [336]:
df.isnull().sum()

Manufacturer           4
Model                  1
Type                   3
Min.Price              7
Price                  2
Max.Price              5
MPG.city               9
MPG.highway            2
AirBags                6
DriveTrain             7
Cylinders              5
EngineSize             2
Horsepower             7
RPM                    3
Rev.per.mile           6
Man.trans.avail        5
Fuel.tank.capacity     8
Passengers             2
Length                 4
Wheelbase              1
Width                  6
Turn.circle            5
Rear.seat.room         4
Luggage.room          19
Weight                 7
Origin                 5
Make                   3
dtype: int64

42. How to replace missing values of multiple numeric columns with the mean?

In [337]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.head()

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,NaN,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

In [344]:
df[['Min.Price','Max.Price']]=df[['Min.Price','Max.Price']].fillna(df[['Min.Price','Max.Price']].mean())

In [345]:
df.head()

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.900000,15.9,18.800000,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.200000,33.9,38.700000,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.900000,29.1,32.300000,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,17.118605,37.7,44.600000,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,17.118605,30.0,21.459091,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

43. How to use apply function on existing columns with global variables as additional arguments?

In [347]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.head()

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,18.8,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,38.7,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,32.3,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,44.6,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,NaN,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

In [356]:
d={'Min.Price':np.nanmean,'Max.Price':np.nanmedian}
df[['Min.Price','Max.Price']]=df[['Min.Price','Max.Price']].apply(lambda x, d:x.fillna(d[x.name](x)),args=(d,))
df.head()

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.900000,15.9,18.80,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.0,37.0,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.200000,33.9,38.70,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.0,38.0,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.900000,29.1,32.30,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.0,37.0,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,17.118605,37.7,44.60,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,NaN,37.0,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,17.118605,30.0,19.15,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.0,39.0,27.0,13.0,3640.0,non-USA,BMW 535i

44. How to select a specific column from a dataframe as a dataframe instead of a series?

In [357]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df.head()

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [366]:
df[['a']]

    a
0   0
1   5
2  10
3  15

45. How to change the order of columns of a dataframe?

In [368]:
df[list('cbade')]

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

In [369]:
def switch_cols(df,col1=None,col2=None):
    colnames=df.columns.tolist()
    i1,i2 = colnames.index(col1),colnames.index(col2)
    colnames[i2],colnames[i1]=colnames[i1],colnames[i2]
    return df[colnames]

In [371]:
switch_cols(df,col1='b',col2='d')

    a   d   c   b   e
0   0   3   2   1   4
1   5   8   7   6   9
2  10  13  12  11  14
3  15  18  17  16  19

In [374]:
df.sort_index(axis=1,ascending=False)

    e   d   c   b   a
0   4   3   2   1   0
1   9   8   7   6   5
2  14  13  12  11  10
3  19  18  17  16  15

46. How to set the number of rows and columns displayed in the output?

In [378]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
pd.set_option('display.max_columns',10)
pd.set_option('display.max_rows',10)
df

,Manufacturer,Model,Type,Min.Price,Price,...,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,...,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,...,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,...,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,...,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,...,27.0,13.0,3640.0,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Eurovan,Van,16.6,19.7,...,34.0,NaN,3960.0,NaN,Volkswagen Eurovan
89,Volkswagen,Passat,Compact,17.6,20.0,...,31.5,14.0,2985.0,non-USA,Volkswagen Passat
90,Volkswagen,Corrado,Sporty,22.9,23.3,...,26.0,15.0,2810.0,non-USA,Volkswagen Corrado
91,Volvo,240,Compact,21.8,22.7,...,29.5,14.0,2985.0,non-USA,Volvo 240
92,NaN,850,Midsize,24.8,26.7,...,30.0,15.0,3245.0,non-USA,Volvo 850

47. How to format or suppress scientific notations in a pandas dataframe?

In [381]:
df = pd.DataFrame(np.random.random(4)**10, columns=['random'])
df.round(4)

   random
0  0.5178
1  0.0000
2  0.0000
3  0.0000

48. How to format all the values in a dataframe as percentages?

In [383]:
df = pd.DataFrame(np.random.random(4), columns=['random'])
df

     random
0  0.421565
1  0.785818
2  0.348964
3  0.552637

In [386]:
df.style.format({'random':'{0:.2%}'.format,})

49. How to filter every nth row in a dataframe?

In [388]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.head()

,Manufacturer,Model,Type,Min.Price,Price,...,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.9,15.9,...,26.5,NaN,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.2,33.9,...,30.0,15.0,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.9,29.1,...,28.0,14.0,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,NaN,37.7,...,31.0,17.0,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,NaN,30.0,...,27.0,13.0,3640.0,non-USA,BMW 535i

In [409]:
rows=df.index[df.index.values%20==0].tolist()
rows
df.loc[rows,['Manufacturer','Model','Type']]

[0, 20, 40, 60, 80]

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

In [410]:
df.loc[::20,['Manufacturer','Model','Type']]

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

50. How to create a primary key index by combining relevant columns?

In [422]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv', usecols=[0,1,2,3,5])

In [423]:
df[['Manufacturer', 'Model','Type']]=df[['Manufacturer', 'Model','Type']].fillna('missing')
df['indexf']=df.Manufacturer+'_'+df.Model+'_'+df.Type
df.set_index(df.indexf)

,Manufacturer,Model,Type,Min.Price,Max.Price,indexf
indexf,,,,,,
Acura_Integra_Small,Acura,Integra,Small,12.9,18.8,Acura_Integra_Small
missing_Legend_Midsize,missing,Legend,Midsize,29.2,38.7,missing_Legend_Midsize
Audi_90_Compact,Audi,90,Compact,25.9,32.3,Audi_90_Compact
Audi_100_Midsize,Audi,100,Midsize,NaN,44.6,Audi_100_Midsize
BMW_535i_Midsize,BMW,535i,Midsize,NaN,NaN,BMW_535i_Midsize
...,...,...,...,...,...,...
Volkswagen_Eurovan_Van,Volkswagen,Eurovan,Van,16.6,22.7,Volkswagen_Eurovan_Van
Volkswagen_Passat_Compact,Volkswagen,Passat,Compact,17.6,22.4,Volkswagen_Passat_Compact
Volkswagen_Corrado_Sporty,Volkswagen,Corrado,Sporty,22.9,23.7,Volkswagen_Corrado_Sporty
Volvo_240_Compact,Volvo,240,Compact,21.8,23.5,Volvo_240_Compact
missing_850_Midsize,missing,850,Midsize,24.8,28.5,missing_850_Midsize

51. How to get the row number of the nth largest value in a column?

In [433]:
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))
df

    a   b   c
0  10   8  18
1   3   9   7
2  21  12  29
3  16  13   7
4   3   8   9
5  25   4  28
6  19  18  27
7  26  20   5
8   5   7  12
9  28   5  20

In [442]:
df.sort_values(by='a',ascending=False)

    a   b   c
9  28   5  20
7  26  20   5
5  25   4  28
2  21  12  29
6  19  18  27
3  16  13   7
0  10   8  18
8   5   7  12
1   3   9   7
4   3   8   9

In [440]:
df.a.argsort()[::-1][5]

6

52. How to find the position of the nth largest value greater than a given value?

In [443]:
ser = pd.Series(np.random.randint(1, 100, 15))
ser

0     30
1     40
2     15
3     32
4     66
      ..
10    89
11    51
12    87
13    63
14     6
Length: 15, dtype: int64

In [446]:
np.argwhere(ser>ser.mean())[1]

array([5])

53. How to get the last n rows of a dataframe with row sum > 100?

In [490]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))
df.head()

    0   1   2   3
0  30  13  26  26
1  30  28  37  15
2  21  25  33  21
3  35  19  25  39
4  28  37  37  22

In [496]:
suma=df.apply(np.sum,axis=1)
suma

0      95
1     110
2     100
3     118
4     124
     ...
10     92
11     69
12     99
13     82
14     92
Length: 15, dtype: int64

In [499]:
df.iloc[np.where(suma>100)[0][-2:],:]

    0   1   2   3
4  28  37  37  22
6  11  35  24  36

54. How to find and cap outliers from a series or dataframe column?

In [501]:
ser = pd.Series(np.logspace(-2, 2, 30))
ser

0       0.010000
1       0.013738
2       0.018874
3       0.025929
4       0.035622
         ...
25     28.072162
26     38.566204
27     52.983169
28     72.789538
29    100.000000
Length: 30, dtype: float64

In [504]:
low,high=ser.quantile([.05,.95])
print(low,high)
ser[ser<low]=low
ser[ser>high]=high
ser

0.016049294076965887 63.876672220183934

0      0.016049
1      0.016049
2      0.018874
3      0.025929
4      0.035622
        ...
25    28.072162
26    38.566204
27    52.983169
28    63.876672
29    63.876672
Length: 30, dtype: float64

55. How to reshape a dataframe to the largest possible square after removing the negative values?

In [506]:
df = pd.DataFrame(np.random.randint(-20, 50, 100).reshape(10,-1))
df.head()

    0   1   2   3   4   5   6   7   8   9
0 -16  11  31 -11  45  18 -18 -17 -17  47
1  -7  -6   8  36  15   7  30  -2  14 -11
2  32  15 -10  11   2 -16  22  29  28 -17
3  18 -20  -8   3  44   0  12 -10   0   3
4   5 -12  47 -11  47  23  -7 -13  10  17

56. How to swap two rows of a dataframe?

In [519]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))
df.head()

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [520]:
a=df.loc[1,].copy()
df.loc[1,]=df.loc[2,]
df.loc[2,]=a
df

    0   1   2   3   4
0   0   1   2   3   4
1  10  11  12  13  14
2   5   6   7   8   9
3  15  16  17  18  19
4  20  21  22  23  24

57. How to reverse the rows of a dataframe?

In [522]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))
df.head()

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [530]:
df.iloc[::,::-1]

    4   3   2   1   0
0   4   3   2   1   0
1   9   8   7   6   5
2  14  13  12  11  10
3  19  18  17  16  15
4  24  23  22  21  20

58. How to create one-hot encodings of a categorical variable (dummy variables)?

In [531]:
df = pd.DataFrame(np.arange(25).reshape(5,-1), columns=list('abcde'))
df.head()

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [532]:
df_onehot = pd.concat([pd.get_dummies(df['a']), df[list('bcde')]], axis=1)
print(df_onehot)

   0  5  10  15  20   b   c   d   e
0  1  0   0   0   0   1   2   3   4
1  0  1   0   0   0   6   7   8   9
2  0  0   1   0   0  11  12  13  14
3  0  0   0   1   0  16  17  18  19
4  0  0   0   0   1  21  22  23  24

59. Which column contains the highest number of row-wise maximum values?

In [534]:
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1))
df.head()

    0   1   2   3
0  66  81  58  60
1  66  30   4  35
2  64  44  55  30
3  11  92  11  24
4  79  96  82   8

In [539]:
df.apply(np.argmax,axis=1).value_counts().index[0]

0

63. How to create a column that contains the penultimate value in each row?

In [541]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
df.head()

    0   1   2   3   4   5   6   7   8   9
0  26  82   8  77  17  21   2  31  61  25
1  65  32  11   5  39  56  92  75  49  15
2  58  68  64  60  93  42  92  44   6  22
3  79  16  22  69  20  78  14  81  77  35
4  16   7  62  36  61  38  60  77  95  25

In [543]:
penult=df.apply(lambda x: x.sort_values().unique()[-2],axis=1)
df['10']=penult
df.head()

    0   1   2   3   4  ...   6   7   8   9  10
0  26  82   8  77  17  ...   2  31  61  25  77
1  65  32  11   5  39  ...  92  75  49  15  75
2  58  68  64  60  93  ...  92  44   6  22  92
3  79  16  22  69  20  ...  14  81  77  35  79
4  16   7  62  36  61  ...  60  77  95  25  77

[5 rows x 11 columns]

64. How to normalize all columns in a dataframe?

In [544]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
df.head()

    0   1   2   3   4   5   6   7   8   9
0  19  88  85  38  81  30  74  94  11  63
1  19  81  25  60   8  40  27  78  17  14
2  99  64  35  88  66  49  96  71  26  98
3  11  55  55  28   1  28  35  41  91  64
4  86  48  39   8  66  12  87  11   7  44

In [546]:
df.apply(lambda x: (x-x.mean())/x.std())

,0,1,2,3,4,5,6,7,8,9
0,-0.700792,1.076765,1.294016,-0.269017,0.883798,-0.361298,0.383374,1.328765,-0.937864,0.379933
1,-0.700792,0.769118,-1.337881,0.407369,-1.410148,0.541947,-1.150122,0.807041,-0.749506,-1.414450
2,1.434956,0.021975,-0.899232,1.268223,0.412439,1.354867,1.101180,0.578787,-0.466970,1.661635
3,-0.914367,-0.373572,-0.021932,-0.576465,-1.630116,-0.541947,-0.889101,-0.399445,1.573571,0.416553
4,1.087897,-0.681219,-0.723772,-1.191361,0.412439,-1.987138,0.807532,-1.377677,-1.063436,-0.315848
5,-0.700792,-1.911808,0.504447,-1.345085,-0.184616,0.451622,0.252864,-1.410284,0.600390,0.086973
6,1.061200,0.109874,1.381746,0.591838,0.600982,0.000000,0.905415,0.024456,1.165463,-1.267969
7,-0.567308,0.988866,-0.197392,1.114499,0.915222,0.541947,-1.411142,0.448356,-0.121648,0.453173

In [547]:
df.apply(lambda x:((x.max()-x)/(x.max()-x.min())))

,0,1,2,3,4,5,6,7,8,9
0,0.909091,0.000000,0.032258,0.588235,0.012346,0.513514,0.285714,0.000000,0.952381,0.416667
1,0.909091,0.102941,1.000000,0.329412,0.913580,0.243243,0.896104,0.190476,0.880952,1.000000
2,0.000000,0.352941,0.838710,0.000000,0.197531,0.000000,0.000000,0.273810,0.773810,0.000000
3,1.000000,0.485294,0.516129,0.705882,1.000000,0.567568,0.792208,0.630952,0.000000,0.404762
4,0.147727,0.588235,0.774194,0.941176,0.197531,1.000000,0.116883,0.988095,1.000000,0.642857
5,0.909091,1.000000,0.322581,1.000000,0.432099,0.270270,0.337662,1.000000,0.369048,0.511905
6,0.159091,0.323529,0.000000,0.258824,0.123457,0.405405,0.077922,0.476190,0.154762,0.952381
7,0.852273,0.029412,0.580645,0.058824,0.000000,0.243243,1.000000,0.321429,0.642857,0.392857

66. How to replace both the diagonals of dataframe with 0?

In [548]:
df = pd.DataFrame(np.random.randint(1,100, 100).reshape(10, -1))
df.head()

    0   1   2   3   4   5   6   7   8   9
0  55  21  42  11  20  83  56   6  94  98
1  25  77  32  25  36  67  98  40  44  56
2  65  89  23  71  94   2  10  61  53  90
3  58   1  79  13  81  52   3  97  25  39
4  12  66  20   9   5  50  35  12  84  38

In [552]:
for i in df.index.values:
    df.loc[i,i]=0
df

    0   1   2   3   4   5   6   7   8   9
0   0  21  42  11  20  83  56   6  94  98
1  25   0  32  25  36  67  98  40  44  56
2  65  89   0  71  94   2  10  61  53  90
3  58   1  79   0  81  52   3  97  25  39
4  12  66  20   9   0  50  35  12  84  38
5  61  33   7  68  45   0  89  30  91  95
6  67  83  98  77   5  45   0  66  97  73
7  81  24  51   4  72   7  14   0  53   8
8  65  48  44  91  32  76  17  59   0  36
9  31  53  28  36  82  47  58  16  12   0

67. How to get the particular group of a groupby dataframe by key?

In [554]:
df = pd.DataFrame({'col1': ['apple', 'banana', 'orange'] * 3,
                   'col2': np.random.rand(9),
                   'col3': np.random.randint(0, 15, 9)})

df.head()

     col1      col2  col3
0   apple  0.468143     3
1  banana  0.958408     7
2  orange  0.377457     5
3   apple  0.302589     6
4  banana  0.037665    10

In [558]:
df_grouped = df.groupby(['col1'])
df_grouped.head()

     col1      col2  col3
0   apple  0.468143     3
1  banana  0.958408     7
2  orange  0.377457     5
3   apple  0.302589     6
4  banana  0.037665    10
5  orange  0.672081    14
6   apple  0.411465     3
7  banana  0.893577     9
8  orange  0.855179    10

In [559]:
df_grouped.get_group('apple')

    col1      col2  col3
0  apple  0.468143     3
3  apple  0.302589     6
6  apple  0.411465     3

68. How to get the nâ€™th largest value of a column when grouped by another column?

In [569]:
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'taste': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

df.head()

    fruit     taste  price
0   apple  0.557581      1
1  banana  0.391629      6
2  orange  0.634617      5
3   apple  0.926004      5
4  banana  0.675832      3

In [577]:
df[df.fruit=='banana'].sort_values(by='taste',ascending=False).iloc[-2]

fruit      banana
taste    0.391629
price           6
Name: 1, dtype: object

69. How to compute grouped mean on pandas dataframe and keep the grouped column as another column (not index)?

In [560]:
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'rating': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})
df.head()

    fruit    rating  price
0   apple  0.049072      4
1  banana  0.626026      8
2  orange  0.872908      4
3   apple  0.254125      1
4  banana  0.049429      5

In [564]:
df.groupby('fruit').price.mean().reset_index()

    fruit     price
0   apple  6.333333
1  banana  7.333333
2  orange  2.666667